case_packing/case_packing/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale    1;

X       0.5;
Y       0.2;
Z       1.0;
Z_neg   -0.1;

vertices
(
    (0. 0. $Z_neg)
    ($X 0. $Z_neg)
    ($X $Y $Z_neg)
    (0. $Y $Z_neg)

    (0. 0. 0)
    ($X 0. 0)
    ($X $Y 0)
    (0. $Y 0)

    (0. 0. $Z)
    ($X 0. $Z)
    ($X $Y $Z)
    (0. $Y $Z)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (25 10 10) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) (25 10 25) simpleGrading (1 1 10)
);

edges
(
);

boundary
(
    top
    {
        type patch;
        faces
        (
            (8 9 10 11)
        );
    }

    ground
    {
        type wall;
        faces
        (
            (0 1 2 3)
        );
    }

    inlet
    {
        type cyclic;
        neighbourPatch outlet;
        faces
        (
            (0 4 7 3)
            (4 8 11 7)
        );
    }

    outlet
    {
        type cyclic;
        neighbourPatch inlet;
        faces
        (
            (1 2 6 5)
            (5 6 10 9)
        );
    }

    front
    {
        type cyclic;
        neighbourPatch back;
        faces
        (
            (0 4 5 1)
            (4 8 9 5)
        );
    }

    back
    {
        type cyclic;
        neighbourPatch front;
        faces
        (
            (3 7 6 2)
            (7 11 10 6)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
