case_packing/case_packing/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default             Gauss linear;
}

divSchemes
{
    default                         none;

    turbulence                          bounded Gauss QUICK;
    div(alphaPhi.air,U.air)             $turbulence;
    div(alphaPhi.air,k.air)             $turbulence;
    div(alphaPhi.air,epsilon.air)       $turbulence;
    div(alphaPhi.air,omega.air)         $turbulence;

    div(((alpha.air*nuEff.air)*dev2(T(grad(U.air))))) Gauss linear;
    
    div(phiGByA,kinematicCloud:alpha)   Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear uncorrected;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             uncorrected;
}

wallDist
{
    method              meshWave;
}


// ************************************************************************* //
